In [11]:
def mySq(x):
    print(x)
    print("--"*50)
    return x**2

def myEXP(x,n):
    return x**n

In [2]:
mySq(3)
myEXP(3,3)

27

In [5]:
import pandas as pd 

df=pd.DataFrame({
    'a':[10,20,30],
    'b':[20,30,40]
})
df['a']**2

0    100
1    400
2    900
Name: a, dtype: int64

In [9]:
df['a'].apply(mySq)

#열벡터 단위의 연산에 apply 사용

10
----------------------------------------------------------------------------------------------------
20
----------------------------------------------------------------------------------------------------
30
----------------------------------------------------------------------------------------------------

0    100
1    400
2    900
Name: a, dtype: int64

In [15]:
df['a'].apply(myEXP,n=3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [21]:

def printMe(x):
    print(x)

df.apply(printMe, axis=0)#디폴트로 axis=0이 설정되어있음 행
df.apply(printMe, axis=1)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [26]:
def myAvg(x,y,z):
    return (x+y+z)/3

def myAvg2(data):
    return (data[0]+data[1]+data[2])/3

df.apply(myAvg2)

a    20.0
b    30.0
dtype: float64

In [30]:
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

아래의 함수는 결측값의 개수를 세는 함수

In [37]:
import numpy as np 

def countMissing(v):
    nullCount = np.sum(pd.isnull(v))
    return nullCount

titanic.apply(countMissing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

널값의 비율

In [39]:
def propMissing(v):
    n= countMissing(v)
    return n/v.size

In [40]:
titanic.apply(propMissing)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [41]:
titanic.apply(propMissing,axis=1)

0      0.066667
1      0.000000
2      0.066667
3      0.000000
4      0.066667
         ...
886    0.066667
887    0.000000
888    0.133333
889    0.000000
890    0.066667
Length: 891, dtype: float64

In [46]:
#타이타닉 데이터 프레임에 'numMissing' 컬롬 추가
#numMissing에는 행단위로 결측값의 개수가 저장

titanic['numMissing'] = titanic.apply(countMissing,axis=1)

titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,numMissing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2

In [53]:
#타이타닉 데이터에서 numMissing 컬럼값이 1보다 큰 모든행 추출
titanic[titanic['numMissing']>1]
#부울린 참조!
#샘플링 가능
titanic[titanic.numMissing>1].sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,numMissing
342,0,2,male,28.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
138,0,3,male,16.0,0,0,9.2167,S,Third,man,True,NaN,Southampton,no,True,2
801,1,2,female,31.0,1,1,26.2500,S,Second,woman,False,NaN,Southampton,yes,False,2
578,0,3,female,NaN,1,0,14.4583,C,Third,woman,False,NaN,Cherbourg,no,False,3
72,0,2,male,21.0,0,0,73.5000,S,Second,man,True,NaN,Southampton,no,True,2
524,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,3
36,1,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True,3
346,1,2,female,40.0,0,0,13.0000,S,Second,woman,False,NaN,Southampton,yes,True,2
219,0,2,male,30.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True,2
764,0,3,male,16.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True,2

In [56]:
tips = sns.load_dataset('tips')
tips.info()

tips['sex_str'] = tips['sex'].astype(str)
tips.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
sex_str         object
dtype: object

In [61]:
tips['total_bill'] = tips['total_bill'].astype(str)
tips.dtypes
tips['total_bill'] = tips['total_bill'].astype(float)
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
sex_str         object
dtype: object

In [79]:
tipsEx = tips.head(10)
# tipsEx의 1,3,5,7번의  행의 'total_bill' 컬럼 값을'missing'으로 변경하기
tipsEx.loc[[1,3,5,7],'total_bill'] = 'missing'
tipsEx.info()
#objext로 바뀜

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  10 non-null     object
 1   tip         10 non-null     float64
 2   sex         10 non-null     category
 3   smoker      10 non-null     category
 4   day         10 non-null     category
 5   time        10 non-null     category
 6   size        10 non-null     int64
 7   sex_str     10 non-null     object
dtypes: category(4), float64(1), int64(1), object(2)
memory usage: 968.0+ bytes

In [ ]:

# tipsEx['total_bill'].astype(float)  <- 불가

In [85]:
tipsEx['total_bill'] = pd.to_numeric(tipsEx['total_bill'], errors ='ignore')
tipsEx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  6 non-null      float64
 1   tip         10 non-null     float64
 2   sex         10 non-null     category
 3   smoker      10 non-null     category
 4   day         10 non-null     category
 5   time        10 non-null     category
 6   size        10 non-null     int64
 7   sex_str     10 non-null     object
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 968.0+ bytes

In [86]:
tipsEx['total_bill'] = pd.to_numeric(tipsEx['total_bill'], errors ='coerce')
tipsEx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  6 non-null      float64
 1   tip         10 non-null     float64
 2   sex         10 non-null     category
 3   smoker      10 non-null     category
 4   day         10 non-null     category
 5   time        10 non-null     category
 6   size        10 non-null     int64
 7   sex_str     10 non-null     object
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 968.0+ bytes

In [89]:
tips['smoker']=tips['smoker'].astype('str')
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    object
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex_str     244 non-null    object
dtypes: category(3), float64(2), int64(1), object(2)
memory usage: 10.7+ KB

In [90]:
tips['smoker']=tips['smoker'].astype('category')
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex_str     244 non-null    object
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 9.2+ KB

In [92]:
df = pd.read_csv("data2/gapminder.tsv",sep ='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [97]:
#year 단위로 그룹화해서 기대수명치의 평균
aleby =df.groupby('year').lifeExp.mean()
aleby

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [101]:
#df에서 year열에 대해 유일한 값만 추출
print(df.year.unique())
set(df.year)

[1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 2002 2007]

{1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002, 2007}

In [106]:
#df에서 year가 1952년도인 모든자료 출력
y1952=df[df.year==1952]
y1952

                 country continent  year  lifeExp       pop    gdpPercap
0            Afghanistan      Asia  1952   28.801   8425333   779.445314
12               Albania    Europe  1952   55.230   1282697  1601.056136
24               Algeria    Africa  1952   43.077   9279525  2449.008185
36                Angola    Africa  1952   30.015   4232095  3520.610273
48             Argentina  Americas  1952   62.485  17876956  5911.315053
...                  ...       ...   ...      ...       ...          ...
1644             Vietnam      Asia  1952   40.412  26246839   605.066492
1656  West Bank and Gaza      Asia  1952   43.160   1030585  1515.592329
1668         Yemen, Rep.      Asia  1952   32.548   4963829   781.717576
1680              Zambia    Africa  1952   42.038   2672000  1147.388831
1692            Zimbabwe    Africa  1952   48.451   3080907   406.884115

[142 rows x 6 columns]

In [108]:
#1952 lifeExp 평균
y1952Mean = y1952.lifeExp.mean()

In [112]:
y1957=df[df.year==1957]
y1957Mean = y1957.lifeExp.mean()
y1962=df[df.year==1962]
y1962Mean = y1962.lifeExp.mean()
y2007=df[df.year==2007]
y2007Mean = y2007.lifeExp.mean()

In [193]:
pd.DataFrame({
    'year' : [1952,1957,1962,2007],
    'avg':[y1952Mean,y1957Mean,y1962Mean,y2007Mean]
})

   year        avg
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [204]:
def myMean(v):
    n=len(v)
    s=0
    for value in v:
        s+=value
    return s/n

#연도단위로 기대 수명치의 평균을 위 함수를 이용해서 출력
df.groupby('year').lifeExp.agg(myMean)
df.groupby('year').lifeExp.agg([np.mean])
df.groupby('year').lifeExp.agg([np.mean, np.std, np.count_nonzero])

           mean        std  count_nonzero
year
1952  49.057620  12.225956          142.0
1957  51.507401  12.231286          142.0
1962  53.609249  12.097245          142.0
1967  55.678290  11.718858          142.0
1972  57.647386  11.381953          142.0
1977  59.570157  11.227229          142.0
1982  61.533197  10.770618          142.0
1987  63.212613  10.556285          142.0
1992  64.160338  11.227380          142.0
1997  65.014676  11.559439          142.0
2002  65.694923  12.279823          142.0
2007  67.007423  12.073021          142.0

In [209]:
from datetime import datetime
t1 =datetime.today()
t2 =datetime(1970,1,1)
t3 =datetime(1970,12,12,13,13,20)
t1 -t2

datetime.timedelta(days=18431, seconds=44306, microseconds=275272)

In [212]:
ebola = pd.read_csv("data2/country_timeseries.csv")
ebola.info()
pd.to_datetime(ebola['Date'])
ebola.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: float64(16), int64(1), object(1)
memory usage: 17.3+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: float64(16), int64(1), object(1)
memory usage: 17.3+ KB

In [216]:
ebola = pd.read_csv("data2/country_timeseries.csv", parse_dates= ['Date'])
ebola.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    datetime64[ns]
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: datetime64[ns](1), float64(16), int64(1)
memory usage: 17.3 KB

In [217]:
# '06/18/20'
pd.to_datetime('06/18/20') #날짜형식을 가진 문자를 날짜형식으로 바꿔준다
pd.to_datetime('06/18/20', format ="%m/%y/%d")
d1.year
d1.month
d1.day

NameError: name 'd1' is not defined

In [220]:
ebola = pd.read_csv("data2/country_timeseries.csv")
ebola['dateDt'] = pd.to_datetime(ebola['Date'])
ebola[['Date','dateDt']]
# ebola['Date'][0].year
ebola['dateDt'][0].year
ebola['dateDt'].dt.month

0       1
1       1
2       1
3       1
4      12
       ..
117     3
118     3
119     3
120     3
121     3
Name: dateDt, Length: 122, dtype: int64

In [223]:
# ebola['dateDt'].month <-에러 발생 
ebola['month'],ebola['day'] = ebola['dateDt'].dt.month, ebola['dateDt'].dt.day
ebola.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 21 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
 18  dateDt               122 non-null    datetime64[ns]
 19  month                122 non-null    int64
 20  day                  122 non-null    int64
dtypes: datetime64[ns](1), float64(16), int64(3), object(1)
memory usage: 20.1+ KB

In [225]:
ebola.tail(5)
ebola.loc[[117,118,120,121]]
ebola.iloc[-5: , :5]

          Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
117  3/27/2014    5         103.0            8.0                6.0
118  3/26/2014    4          86.0            NaN                NaN
119  3/25/2014    3          86.0            NaN                NaN
120  3/24/2014    2          86.0            NaN                NaN
121  3/22/2014    0          49.0            NaN                NaN

In [228]:
ebola['dateDt'] #가장 오래된 날짜는?
ebola['dateDt'].min() #수치 데이터라 사용가능함
ebola['dateDt']-ebola['dateDt'].min() #최초 발병일로 부터 며칠이나 되었나

0     289 days
1     288 days
2     287 days
3     286 days
4     284 days
        ...
117     5 days
118     4 days
119     3 days
120     2 days
121     0 days
Name: dateDt, Length: 122, dtype: timedelta64[ns]

In [233]:
banks = pd.read_csv("data2/banklist.csv")
banks.info()

banks = pd.read_csv("data2/banklist.csv", parse_dates=[5,6])
banks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 555 entries, 0 to 554
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Bank Name              555 non-null    object
 1   City                   555 non-null    object
 2   ST                     555 non-null    object
 3   CERT                   555 non-null    int64
 4   Acquiring Institution  555 non-null    object
 5   Closing Date           555 non-null    object
 6   Updated Date           555 non-null    object
dtypes: int64(1), object(6)
memory usage: 30.5+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 555 entries, 0 to 554
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Bank Name              555 non-null    object
 1   City                   555 non-null    object
 2   ST                     555 non-null    object
 3   CERT                   555 non-null    int64
 4   Acquiring Institution  555 non-null    object
 5   Closing Date           555 non-null    datetime64[ns]
 6   Updated Date           555 non-null    datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 30.5+ KB

In [240]:
banks['Closing Date'].dt.year #연도만
banks['Closing_year'] ,banks['Closing_quarter']=banks['Closing Date'].dt.year,banks['Closing Date'].dt.quarter

In [242]:
# banks.groupby(['Closing_year']).size()
 banks[''].value_counts()

IndentationError: unexpected indent (<ipython-input-242-f05d33e0b4d2>, line 2)

In [244]:
banks.groupby(['Closing_year']).sum()

                 CERT  Closing_quarter
Closing_year
2000            24844                8
2001           107787                9
2002           248023               21
2003            65936                7
2004            86195                5
2007            84776                8
2008           772428               81
2009          4406094              399
2010          5003277              374
2011          3285484              220
2012          1513266              114
2013           929287               54
2014           496014               41
2015           266186               17
2016            77020               11
2017           228170               17

In [247]:
    Closing_yearQ = banks.groupby(['Closing_year','Closing_quarter'])

In [246]:
import matplotlib.pyplot as plt 
Closing_yearQ.plot()

Closing_year  Closing_quarter
2000          4                  AxesSubplot(0.125,0.125;0.775x0.755)
2001          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
2002          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2003          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2004          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
2007          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2008          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2009          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2010          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2011          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2012          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2013          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2014          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2015          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
2016          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              3                  AxesSubplot(0.125,0.125;0.775x0.755)
2017          1                  AxesSubplot(0.125,0.125;0.775x0.755)
              2                  AxesSubplot(0.125,0.125;0.775x0.755)
              4                  AxesSubplot(0.125,0.125;0.775x0.755)
dtype: object

ValueError: view limit minimum -32595.35 is less than 1 and is an invalid Matplotlib date value. This often happens if you pass a non-datetime value to an axis that has datetime units